AplicacionEnvios/src/jbiServiceUnits/ServicioEnvios/Descriptor/ServicioEnviosWSDL.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="ServicioEnviosWSDL" targetNamespace="http://j2ee.netbeans.org/wsdl/ServicioEnvios/Descriptor/ServicioEnviosWSDL"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/ServicioEnvios/Descriptor/ServicioEnviosWSDL" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types/>
    <message name="ServicioEnviosWSDLOperationRequest">
        <part name="clienteId" type="xsd:int"/>
        <part name="entregaId" type="xsd:int"/>
        <part name="fechaEntrega" type="xsd:date"/>
        <part name="fechaPrometida" type="xsd:date"/>
        <part name="ordenId" type="xsd:int"/>
        <part name="status" type="xsd:int"/>
    </message>
    <message name="ServicioEnviosWSDLOperationResponse">
        <part name="resultado" type="xsd:string"/>
    </message>
    <portType name="ServicioEnviosWSDLPortType">
        <operation name="ServicioEnviosWSDLOperation">
            <input name="input1" message="tns:ServicioEnviosWSDLOperationRequest"/>
            <output name="output1" message="tns:ServicioEnviosWSDLOperationResponse"/>
        </operation>
    </portType>
    <binding name="ServicioEnviosWSDLBinding" type="tns:ServicioEnviosWSDLPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="ServicioEnviosWSDLOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/ServicioEnvios/Descriptor/ServicioEnviosWSDL"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/ServicioEnvios/Descriptor/ServicioEnviosWSDL"/>
            </output>
        </operation>
    </binding>
    <service name="ServicioEnviosWSDLService">
        <port name="ServicioEnviosWSDLPort" binding="tns:ServicioEnviosWSDLBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/ServicioEnviosWSDLService/ServicioEnviosWSDLPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="ServicioEnviosWSDL">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="ServicioEnviosWSDLPortTypeRole" portType="tns:ServicioEnviosWSDLPortType"/>
    </plnk:partnerLinkType>
</definitions>
