AplicacionEnvios/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://j2ee.netbeans.org/wsdl/ServicioEnvios/Descriptor/ServicioEnviosWSDL">
  <soapenv:Body>
    <ser:ServicioEnviosWSDLOperation>
      <clienteId>1</clienteId>
      <entregaId>3</entregaId>
      <fechaEntrega>2008-09-28</fechaEntrega>
      <fechaPrometida>2014-09-18</fechaPrometida>
      <ordenId>3</ordenId>
      <status>1</status>
    </ser:ServicioEnviosWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>